yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux383a.h
/* Port 0 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CR2_0       : 1;
  unsigned char CR2_1       : 1;
  unsigned char CR2_2       : 1;
  unsigned char CR2_3       : 1;
  unsigned char CR2_4       : 1;
  unsigned char CR2_5       : 1;
  unsigned char CR2_6       : 1;
  unsigned char CR2_7       : 1;
} __BITS_P0_CR2;
#endif
__IO_REG8_BIT(P0_CR2,      0x5004, __READ_WRITE, __BITS_P0_CR2);


/*-------------------------------------------------------------------------
 *      Port 0 Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define P0_ODR_ODR0              P0_ODR_bit.ODR0
#define P0_ODR_ODR1              P0_ODR_bit.ODR1
#define P0_ODR_ODR2              P0_ODR_bit.ODR2
#define P0_ODR_ODR3              P0_ODR_bit.ODR3
#define P0_ODR_ODR4              P0_ODR_bit.ODR4
#define P0_ODR_ODR5              P0_ODR_bit.ODR5
#define P0_ODR_ODR6              P0_ODR_bit.ODR6
#define P0_ODR_ODR7              P0_ODR_bit.ODR7

#define P0_IDR_IDR0              P0_IDR_bit.IDR0
#define P0_IDR_IDR1              P0_IDR_bit.IDR1
#define P0_IDR_IDR2              P0_IDR_bit.IDR2
#define P0_IDR_IDR3              P0_IDR_bit.IDR3
#define P0_IDR_IDR4              P0_IDR_bit.IDR4
#define P0_IDR_IDR5              P0_IDR_bit.IDR5
#define P0_IDR_IDR6              P0_IDR_bit.IDR6
#define P0_IDR_IDR7              P0_IDR_bit.IDR7

#define P0_DDR_DDR0              P0_DDR_bit.DDR0
#define P0_DDR_DDR1              P0_DDR_bit.DDR1
#define P0_DDR_DDR2              P0_DDR_bit.DDR2
#define P0_DDR_DDR3              P0_DDR_bit.DDR3
#define P0_DDR_DDR4              P0_DDR_bit.DDR4
#define P0_DDR_DDR5              P0_DDR_bit.DDR5
#define P0_DDR_DDR6              P0_DDR_bit.DDR6
#define P0_DDR_DDR7              P0_DDR_bit.DDR7

#define P0_CR1_CR1_0             P0_CR1_bit.CR1_0
#define P0_CR1_CR1_1             P0_CR1_bit.CR1_1
#define P0_CR1_CR1_2             P0_CR1_bit.CR1_2
#define P0_CR1_CR1_3             P0_CR1_bit.CR1_3
#define P0_CR1_CR1_4             P0_CR1_bit.CR1_4
#define P0_CR1_CR1_5             P0_CR1_bit.CR1_5
#define P0_CR1_CR1_6             P0_CR1_bit.CR1_6
#define P0_CR1_CR1_7             P0_CR1_bit.CR1_7

#define P0_CR2_CR2_0             P0_CR2_bit.CR2_0
#define P0_CR2_CR2_1             P0_CR2_bit.CR2_1
#define P0_CR2_CR2_2             P0_CR2_bit.CR2_2
#define P0_CR2_CR2_3             P0_CR2_bit.CR2_3
#define P0_CR2_CR2_4             P0_CR2_bit.CR2_4
#define P0_CR2_CR2_5             P0_CR2_bit.CR2_5
#define P0_CR2_CR2_6             P0_CR2_bit.CR2_6
#define P0_CR2_CR2_7             P0_CR2_bit.CR2_7

#endif

/*-------------------------------------------------------------------------
 *      Port 0 Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_P0_ODR_ODR0         0x01
#define MASK_P0_ODR_ODR1         0x02
#define MASK_P0_ODR_ODR2         0x04
#define MASK_P0_ODR_ODR3         0x08
#define MASK_P0_ODR_ODR4         0x10
#define MASK_P0_ODR_ODR5         0x20
#define MASK_P0_ODR_ODR6         0x40
#define MASK_P0_ODR_ODR7         0x80

#define MASK_P0_IDR_IDR0         0x01
#define MASK_P0_IDR_IDR1         0x02
#define MASK_P0_IDR_IDR2         0x04
#define MASK_P0_IDR_IDR3         0x08
#define MASK_P0_IDR_IDR4         0x10
#define MASK_P0_IDR_IDR5         0x20
#define MASK_P0_IDR_IDR6         0x40
#define MASK_P0_IDR_IDR7         0x80

#define MASK_P0_DDR_DDR0         0x01
#define MASK_P0_DDR_DDR1         0x02
#define MASK_P0_DDR_DDR2         0x04
#define MASK_P0_DDR_DDR3         0x08
#define MASK_P0_DDR_DDR4         0x10
#define MASK_P0_DDR_DDR5         0x20
#define MASK_P0_DDR_DDR6         0x40
#define MASK_P0_DDR_DDR7         0x80

#define MASK_P0_CR1_CR1_0        0x01
#define MASK_P0_CR1_CR1_1        0x02
#define MASK_P0_CR1_CR1_2        0x04
#define MASK_P0_CR1_CR1_3        0x08
#define MASK_P0_CR1_CR1_4        0x10
#define MASK_P0_CR1_CR1_5        0x20
#define MASK_P0_CR1_CR1_6        0x40
#define MASK_P0_CR1_CR1_7        0x80

#define MASK_P0_CR2_CR2_0        0x01
#define MASK_P0_CR2_CR2_1        0x02
#define MASK_P0_CR2_CR2_2        0x04
#define MASK_P0_CR2_CR2_3        0x08
#define MASK_P0_CR2_CR2_4        0x10
#define MASK_P0_CR2_CR2_5        0x20
#define MASK_P0_CR2_CR2_6        0x40
#define MASK_P0_CR2_CR2_7        0x80


/*-------------------------------------------------------------------------
 *      Port 1 Registers register definitions
 *-----------------------------------------------------------------------*/
/* Port 1 output register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ODR0        : 1;
  unsigned char ODR1        : 1;
  unsigned char ODR2        : 1;
  unsigned char ODR3        : 1;
  unsigned char ODR4        : 1;
  unsigned char ODR5        : 1;
  unsigned char ODR6        : 1;
  unsigned char ODR7        : 1;
} __BITS_P1_ODR;
#endif
__IO_REG8_BIT(P1_ODR,      0x5005, __READ_WRITE, __BITS_P1_ODR);

/* Port 1 input register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IDR0        : 1;
  unsigned char IDR1        : 1;
  unsigned char IDR2        : 1;
  unsigned char IDR3        : 1;
  unsigned char IDR4        : 1;
  unsigned char IDR5        : 1;
  unsigned char IDR6        : 1;
  unsigned char IDR7        : 1;
} __BITS_P1_IDR;
#endif
__IO_REG8_BIT(P1_IDR,      0x5006, __READ, __BITS_P1_IDR);

/* Port 1 data direction register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DDR0        : 1;
  unsigned char DDR1        : 1;
  unsigned char DDR2        : 1;
  unsigned char DDR3        : 1;
  unsigned char DDR4        : 1;
  unsigned char DDR5        : 1;
  unsigned char DDR6        : 1;
  unsigned char DDR7        : 1;
} __BITS_P1_DDR;
#endif
__IO_REG8_BIT(P1_DDR,      0x5007, __READ_WRITE, __BITS_P1_DDR);

/* Port 1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CR1_0       : 1;
  unsigned char CR1_1       : 1;
  unsigned char CR1_2       : 1;
  unsigned char CR1_3       : 1;
  unsigned char CR1_4       : 1;
  unsigned char CR1_5       : 1;
  unsigned char CR1_6       : 1;
  unsigned char CR1_7       : 1;
} __BITS_P1_CR1;
#endif
__IO_REG8_BIT(P1_CR1,      0x5008, __READ_WRITE, __BITS_P1_CR1);

