yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux383a.h
/* Connect Box selection for SMED4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONB_S4_00  : 1;
  unsigned char CONB_S4_01  : 1;
  unsigned char CONB_S4_10  : 1;
  unsigned char CONB_S4_11  : 1;
  unsigned char CONB_S4_20  : 1;
  unsigned char CONB_S4_21  : 1;
} __BITS_MSC_CBOXS4;
#endif
__IO_REG8_BIT(MSC_CBOXS4,  0x502E, __READ_WRITE, __BITS_MSC_CBOXS4);

/* Connect Box selection for SMED5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONB_S5_00  : 1;
  unsigned char CONB_S5_01  : 1;
  unsigned char CONB_S5_10  : 1;
  unsigned char CONB_S5_11  : 1;
  unsigned char CONB_S5_20  : 1;
  unsigned char CONB_S5_21  : 1;
} __BITS_MSC_CBOXS5;
#endif
__IO_REG8_BIT(MSC_CBOXS5,  0x502F, __READ_WRITE, __BITS_MSC_CBOXS5);

/* I/O mux Port0 P0 SMED FSM state */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMD_FSML0   : 3;
  unsigned char SEL_FSMEN0  : 1;
  unsigned char SMD_FSML1   : 3;
  unsigned char SEL_FSMEN1  : 1;
} __BITS_MSC_IOMXSMD;
#endif
__IO_REG8_BIT(MSC_IOMXSMD, 0x5030, __READ_WRITE, __BITS_MSC_IOMXSMD);

/* Port 3 inputs read register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char COMP0       : 1;
  unsigned char COMP1       : 1;
  unsigned char COMP2       : 1;
  unsigned char COMP3       : 1;
} __BITS_MSC_INPP3;
#endif
__IO_REG8_BIT(MSC_INPP3,   0x5039, __READ, __BITS_MSC_INPP3);

/* I/O mux Port0 (GPIO0s) signals */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEL_P010    : 2;
  unsigned char SEL_P032    : 2;
  unsigned char SEL_P054    : 2;
} __BITS_MSC_IOMXP0;
#endif
__IO_REG8_BIT(MSC_IOMXP0,  0x503A, __READ_WRITE, __BITS_MSC_IOMXP0);

/* I/O mux Port1 (PWMs/GPIO1s) signals */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEL_P10     : 1;
  unsigned char SEL_P11     : 1;
  unsigned char SEL_P12     : 1;
  unsigned char SEL_P13     : 1;
  unsigned char SEL_P14     : 1;
  unsigned char SEL_P15     : 1;
} __BITS_MSC_IOMXP1;
#endif
__IO_REG8_BIT(MSC_IOMXP1,  0x503B, __READ_WRITE, __BITS_MSC_IOMXP1);


/*-------------------------------------------------------------------------
 *      MSC Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define MSC_CFGP00_INT_LEV       MSC_CFGP00_bit.INT_LEV
#define MSC_CFGP00_INT_SEL0      MSC_CFGP00_bit.INT_SEL0
#define MSC_CFGP00_INT_SEL1      MSC_CFGP00_bit.INT_SEL1
#define MSC_CFGP00_INT_ENB       MSC_CFGP00_bit.INT_ENB
#define MSC_CFGP00_INT_TYPE      MSC_CFGP00_bit.INT_TYPE

#define MSC_CFGP01_INT_LEV       MSC_CFGP01_bit.INT_LEV
#define MSC_CFGP01_INT_SEL0      MSC_CFGP01_bit.INT_SEL0
#define MSC_CFGP01_INT_SEL1      MSC_CFGP01_bit.INT_SEL1
#define MSC_CFGP01_INT_ENB       MSC_CFGP01_bit.INT_ENB
#define MSC_CFGP01_INT_TYPE      MSC_CFGP01_bit.INT_TYPE

#define MSC_CFGP02_INT_LEV       MSC_CFGP02_bit.INT_LEV
#define MSC_CFGP02_INT_SEL0      MSC_CFGP02_bit.INT_SEL0
#define MSC_CFGP02_INT_SEL1      MSC_CFGP02_bit.INT_SEL1
#define MSC_CFGP02_INT_ENB       MSC_CFGP02_bit.INT_ENB
#define MSC_CFGP02_INT_TYPE      MSC_CFGP02_bit.INT_TYPE

#define MSC_CFGP03_INT_LEV       MSC_CFGP03_bit.INT_LEV
#define MSC_CFGP03_INT_SEL0      MSC_CFGP03_bit.INT_SEL0
#define MSC_CFGP03_INT_SEL1      MSC_CFGP03_bit.INT_SEL1
#define MSC_CFGP03_INT_ENB       MSC_CFGP03_bit.INT_ENB
#define MSC_CFGP03_INT_TYPE      MSC_CFGP03_bit.INT_TYPE

#define MSC_CFGP04_INT_LEV       MSC_CFGP04_bit.INT_LEV
#define MSC_CFGP04_INT_SEL0      MSC_CFGP04_bit.INT_SEL0
#define MSC_CFGP04_INT_SEL1      MSC_CFGP04_bit.INT_SEL1
#define MSC_CFGP04_INT_ENB       MSC_CFGP04_bit.INT_ENB
#define MSC_CFGP04_INT_TYPE      MSC_CFGP04_bit.INT_TYPE

#define MSC_CFGP05_INT_LEV       MSC_CFGP05_bit.INT_LEV
#define MSC_CFGP05_INT_SEL0      MSC_CFGP05_bit.INT_SEL0
#define MSC_CFGP05_INT_SEL1      MSC_CFGP05_bit.INT_SEL1
#define MSC_CFGP05_INT_ENB       MSC_CFGP05_bit.INT_ENB
#define MSC_CFGP05_INT_TYPE      MSC_CFGP05_bit.INT_TYPE

#define MSC_CFGP20_INT_LEV       MSC_CFGP20_bit.INT_LEV
#define MSC_CFGP20_INT_SEL0      MSC_CFGP20_bit.INT_SEL0
#define MSC_CFGP20_INT_SEL1      MSC_CFGP20_bit.INT_SEL1
#define MSC_CFGP20_INT_ENB       MSC_CFGP20_bit.INT_ENB
#define MSC_CFGP20_INT_TYPE      MSC_CFGP20_bit.INT_TYPE

#define MSC_CFGP21_INT_LEV       MSC_CFGP21_bit.INT_LEV
#define MSC_CFGP21_INT_SEL0      MSC_CFGP21_bit.INT_SEL0
#define MSC_CFGP21_INT_SEL1      MSC_CFGP21_bit.INT_SEL1
#define MSC_CFGP21_INT_ENB       MSC_CFGP21_bit.INT_ENB
#define MSC_CFGP21_INT_TYPE      MSC_CFGP21_bit.INT_TYPE

#define MSC_CFGP22_INT_LEV       MSC_CFGP22_bit.INT_LEV
#define MSC_CFGP22_INT_SEL0      MSC_CFGP22_bit.INT_SEL0
#define MSC_CFGP22_INT_SEL1      MSC_CFGP22_bit.INT_SEL1
#define MSC_CFGP22_INT_ENB       MSC_CFGP22_bit.INT_ENB
#define MSC_CFGP22_INT_TYPE      MSC_CFGP22_bit.INT_TYPE

#define MSC_CFGP23_INT_LEV       MSC_CFGP23_bit.INT_LEV
#define MSC_CFGP23_INT_SEL0      MSC_CFGP23_bit.INT_SEL0
#define MSC_CFGP23_INT_SEL1      MSC_CFGP23_bit.INT_SEL1
#define MSC_CFGP23_INT_ENB       MSC_CFGP23_bit.INT_ENB
#define MSC_CFGP23_INT_TYPE      MSC_CFGP23_bit.INT_TYPE

#define MSC_CFGP24_INT_LEV       MSC_CFGP24_bit.INT_LEV
#define MSC_CFGP24_INT_SEL0      MSC_CFGP24_bit.INT_SEL0
#define MSC_CFGP24_INT_SEL1      MSC_CFGP24_bit.INT_SEL1
#define MSC_CFGP24_INT_ENB       MSC_CFGP24_bit.INT_ENB
#define MSC_CFGP24_INT_TYPE      MSC_CFGP24_bit.INT_TYPE

#define MSC_CFGP25_INT_LEV       MSC_CFGP25_bit.INT_LEV
#define MSC_CFGP25_INT_SEL0      MSC_CFGP25_bit.INT_SEL0
#define MSC_CFGP25_INT_SEL1      MSC_CFGP25_bit.INT_SEL1
#define MSC_CFGP25_INT_ENB       MSC_CFGP25_bit.INT_ENB
#define MSC_CFGP25_INT_TYPE      MSC_CFGP25_bit.INT_TYPE

#define MSC_STSP0_BIT_0_INT      MSC_STSP0_bit.BIT_0_INT
#define MSC_STSP0_BIT_1_INT      MSC_STSP0_bit.BIT_1_INT
#define MSC_STSP0_BIT_2_INT      MSC_STSP0_bit.BIT_2_INT
#define MSC_STSP0_BIT_3_INT      MSC_STSP0_bit.BIT_3_INT
#define MSC_STSP0_BIT_4_INT      MSC_STSP0_bit.BIT_4_INT
#define MSC_STSP0_BIT_5_INT      MSC_STSP0_bit.BIT_5_INT

