yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux383a.h
#define MSC_STSP2_BIT_0_INT      MSC_STSP2_bit.BIT_0_INT
#define MSC_STSP2_BIT_1_INT      MSC_STSP2_bit.BIT_1_INT
#define MSC_STSP2_BIT_2_INT      MSC_STSP2_bit.BIT_2_INT
#define MSC_STSP2_BIT_3_INT      MSC_STSP2_bit.BIT_3_INT
#define MSC_STSP2_BIT_4_INT      MSC_STSP2_bit.BIT_4_INT
#define MSC_STSP2_BIT_5_INT      MSC_STSP2_bit.BIT_5_INT

#define MSC_INPP2_DATA_IN        MSC_INPP2_bit.DATA_IN

#define MSC_DACCTR_DAC0_EN       MSC_DACCTR_bit.DAC0_EN
#define MSC_DACCTR_DAC1_EN       MSC_DACCTR_bit.DAC1_EN
#define MSC_DACCTR_DAC2_EN       MSC_DACCTR_bit.DAC2_EN
#define MSC_DACCTR_DAC3_EN       MSC_DACCTR_bit.DAC3_EN
#define MSC_DACCTR_CP3_EN        MSC_DACCTR_bit.CP3_EN
#define MSC_DACCTR_CP3_SEL       MSC_DACCTR_bit.CP3_SEL
#define MSC_DACCTR_DACBIAS_EN    MSC_DACCTR_bit.DACBIAS_EN

#define MSC_DACIN0_DAC_IN0       MSC_DACIN0_bit.DAC_IN0

#define MSC_DACIN1_DAC_IN1       MSC_DACIN1_bit.DAC_IN1

#define MSC_DACIN2_DAC_IN2       MSC_DACIN2_bit.DAC_IN2

#define MSC_DACIN3_DAC_IN3       MSC_DACIN3_bit.DAC_IN3

#define MSC_SMDCFG01_SMED0_GLBCONF MSC_SMDCFG01_bit.SMED0_GLBCONF
#define MSC_SMDCFG01_SMED1_GLBCONF MSC_SMDCFG01_bit.SMED1_GLBCONF

#define MSC_SMDCFG23_SMED2_GLBCONF MSC_SMDCFG23_bit.SMED2_GLBCONF
#define MSC_SMDCFG23_SMED3_GLBCONF MSC_SMDCFG23_bit.SMED3_GLBCONF

#define MSC_SMDCFG45_SMED4_GLBCONF MSC_SMDCFG45_bit.SMED4_GLBCONF
#define MSC_SMDCFG45_SMED5_GLBCONF MSC_SMDCFG45_bit.SMED5_GLBCONF

#define MSC_SMSWEV_SW0           MSC_SMSWEV_bit.SW0
#define MSC_SMSWEV_SW1           MSC_SMSWEV_bit.SW1
#define MSC_SMSWEV_SW2           MSC_SMSWEV_bit.SW2
#define MSC_SMSWEV_SW3           MSC_SMSWEV_bit.SW3
#define MSC_SMSWEV_SW4           MSC_SMSWEV_bit.SW4
#define MSC_SMSWEV_SW5           MSC_SMSWEV_bit.SW5

#define MSC_SMULOCK_USE_UNLOCK_01 MSC_SMULOCK_bit.USE_UNLOCK_01
#define MSC_SMULOCK_USE_UNLOCK_23 MSC_SMULOCK_bit.USE_UNLOCK_23
#define MSC_SMULOCK_USE_UNLOCK_45 MSC_SMULOCK_bit.USE_UNLOCK_45
#define MSC_SMULOCK_UNLOCK_01    MSC_SMULOCK_bit.UNLOCK_01
#define MSC_SMULOCK_UNLOCK_23    MSC_SMULOCK_bit.UNLOCK_23
#define MSC_SMULOCK_UNLOCK_45    MSC_SMULOCK_bit.UNLOCK_45

#define MSC_CBOXS0_CONB_S0_00    MSC_CBOXS0_bit.CONB_S0_00
#define MSC_CBOXS0_CONB_S0_01    MSC_CBOXS0_bit.CONB_S0_01
#define MSC_CBOXS0_CONB_S0_10    MSC_CBOXS0_bit.CONB_S0_10
#define MSC_CBOXS0_CONB_S0_11    MSC_CBOXS0_bit.CONB_S0_11
#define MSC_CBOXS0_CONB_S0_20    MSC_CBOXS0_bit.CONB_S0_20
#define MSC_CBOXS0_CONB_S0_21    MSC_CBOXS0_bit.CONB_S0_21

#define MSC_CBOXS1_CONB_S1_00    MSC_CBOXS1_bit.CONB_S1_00
#define MSC_CBOXS1_CONB_S1_01    MSC_CBOXS1_bit.CONB_S1_01
#define MSC_CBOXS1_CONB_S1_10    MSC_CBOXS1_bit.CONB_S1_10
#define MSC_CBOXS1_CONB_S1_11    MSC_CBOXS1_bit.CONB_S1_11
#define MSC_CBOXS1_CONB_S1_20    MSC_CBOXS1_bit.CONB_S1_20
#define MSC_CBOXS1_CONB_S1_21    MSC_CBOXS1_bit.CONB_S1_21

#define MSC_CBOXS2_CONB_S2_00    MSC_CBOXS2_bit.CONB_S2_00
#define MSC_CBOXS2_CONB_S2_01    MSC_CBOXS2_bit.CONB_S2_01
#define MSC_CBOXS2_CONB_S2_10    MSC_CBOXS2_bit.CONB_S2_10
#define MSC_CBOXS2_CONB_S2_11    MSC_CBOXS2_bit.CONB_S2_11
#define MSC_CBOXS2_CONB_S2_20    MSC_CBOXS2_bit.CONB_S2_20
#define MSC_CBOXS2_CONB_S2_21    MSC_CBOXS2_bit.CONB_S2_21

#define MSC_CBOXS3_CONB_S3_00    MSC_CBOXS3_bit.CONB_S3_00
#define MSC_CBOXS3_CONB_S3_01    MSC_CBOXS3_bit.CONB_S3_01
#define MSC_CBOXS3_CONB_S3_10    MSC_CBOXS3_bit.CONB_S3_10
#define MSC_CBOXS3_CONB_S3_11    MSC_CBOXS3_bit.CONB_S3_11
#define MSC_CBOXS3_CONB_S3_20    MSC_CBOXS3_bit.CONB_S3_20
#define MSC_CBOXS3_CONB_S3_21    MSC_CBOXS3_bit.CONB_S3_21

#define MSC_CBOXS4_CONB_S4_00    MSC_CBOXS4_bit.CONB_S4_00
#define MSC_CBOXS4_CONB_S4_01    MSC_CBOXS4_bit.CONB_S4_01
#define MSC_CBOXS4_CONB_S4_10    MSC_CBOXS4_bit.CONB_S4_10
#define MSC_CBOXS4_CONB_S4_11    MSC_CBOXS4_bit.CONB_S4_11
#define MSC_CBOXS4_CONB_S4_20    MSC_CBOXS4_bit.CONB_S4_20
#define MSC_CBOXS4_CONB_S4_21    MSC_CBOXS4_bit.CONB_S4_21

#define MSC_CBOXS5_CONB_S5_00    MSC_CBOXS5_bit.CONB_S5_00
#define MSC_CBOXS5_CONB_S5_01    MSC_CBOXS5_bit.CONB_S5_01
#define MSC_CBOXS5_CONB_S5_10    MSC_CBOXS5_bit.CONB_S5_10
#define MSC_CBOXS5_CONB_S5_11    MSC_CBOXS5_bit.CONB_S5_11
#define MSC_CBOXS5_CONB_S5_20    MSC_CBOXS5_bit.CONB_S5_20
#define MSC_CBOXS5_CONB_S5_21    MSC_CBOXS5_bit.CONB_S5_21

#define MSC_IOMXSMD_SMD_FSML0    MSC_IOMXSMD_bit.SMD_FSML0
#define MSC_IOMXSMD_SEL_FSMEN0   MSC_IOMXSMD_bit.SEL_FSMEN0
#define MSC_IOMXSMD_SMD_FSML1    MSC_IOMXSMD_bit.SMD_FSML1
#define MSC_IOMXSMD_SEL_FSMEN1   MSC_IOMXSMD_bit.SEL_FSMEN1

#define MSC_INPP3_COMP0          MSC_INPP3_bit.COMP0
#define MSC_INPP3_COMP1          MSC_INPP3_bit.COMP1
#define MSC_INPP3_COMP2          MSC_INPP3_bit.COMP2
#define MSC_INPP3_COMP3          MSC_INPP3_bit.COMP3

#define MSC_IOMXP0_SEL_P010      MSC_IOMXP0_bit.SEL_P010
#define MSC_IOMXP0_SEL_P032      MSC_IOMXP0_bit.SEL_P032
#define MSC_IOMXP0_SEL_P054      MSC_IOMXP0_bit.SEL_P054

#define MSC_IOMXP1_SEL_P10       MSC_IOMXP1_bit.SEL_P10
#define MSC_IOMXP1_SEL_P11       MSC_IOMXP1_bit.SEL_P11
#define MSC_IOMXP1_SEL_P12       MSC_IOMXP1_bit.SEL_P12
#define MSC_IOMXP1_SEL_P13       MSC_IOMXP1_bit.SEL_P13
#define MSC_IOMXP1_SEL_P14       MSC_IOMXP1_bit.SEL_P14
#define MSC_IOMXP1_SEL_P15       MSC_IOMXP1_bit.SEL_P15

#endif

/*-------------------------------------------------------------------------
 *      MSC Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_MSC_CFGP00_INT_LEV  0x01
#define MASK_MSC_CFGP00_INT_SEL0 0x02
#define MASK_MSC_CFGP00_INT_SEL1 0x04
#define MASK_MSC_CFGP00_INT_ENB  0x08
#define MASK_MSC_CFGP00_INT_TYPE 0x10

#define MASK_MSC_CFGP01_INT_LEV  0x01
#define MASK_MSC_CFGP01_INT_SEL0 0x02
#define MASK_MSC_CFGP01_INT_SEL1 0x04
#define MASK_MSC_CFGP01_INT_ENB  0x08
#define MASK_MSC_CFGP01_INT_TYPE 0x10

#define MASK_MSC_CFGP02_INT_LEV  0x01
#define MASK_MSC_CFGP02_INT_SEL0 0x02
#define MASK_MSC_CFGP02_INT_SEL1 0x04
#define MASK_MSC_CFGP02_INT_ENB  0x08
#define MASK_MSC_CFGP02_INT_TYPE 0x10

#define MASK_MSC_CFGP03_INT_LEV  0x01
#define MASK_MSC_CFGP03_INT_SEL0 0x02
#define MASK_MSC_CFGP03_INT_SEL1 0x04
#define MASK_MSC_CFGP03_INT_ENB  0x08
#define MASK_MSC_CFGP03_INT_TYPE 0x10

#define MASK_MSC_CFGP04_INT_LEV  0x01
#define MASK_MSC_CFGP04_INT_SEL0 0x02
#define MASK_MSC_CFGP04_INT_SEL1 0x04
#define MASK_MSC_CFGP04_INT_ENB  0x08
#define MASK_MSC_CFGP04_INT_TYPE 0x10

#define MASK_MSC_CFGP05_INT_LEV  0x01
#define MASK_MSC_CFGP05_INT_SEL0 0x02
#define MASK_MSC_CFGP05_INT_SEL1 0x04
#define MASK_MSC_CFGP05_INT_ENB  0x08
#define MASK_MSC_CFGP05_INT_TYPE 0x10

#define MASK_MSC_CFGP20_INT_LEV  0x01
#define MASK_MSC_CFGP20_INT_SEL0 0x02
#define MASK_MSC_CFGP20_INT_SEL1 0x04
#define MASK_MSC_CFGP20_INT_ENB  0x08
#define MASK_MSC_CFGP20_INT_TYPE 0x10

#define MASK_MSC_CFGP21_INT_LEV  0x01
#define MASK_MSC_CFGP21_INT_SEL0 0x02
#define MASK_MSC_CFGP21_INT_SEL1 0x04
#define MASK_MSC_CFGP21_INT_ENB  0x08
#define MASK_MSC_CFGP21_INT_TYPE 0x10

#define MASK_MSC_CFGP22_INT_LEV  0x01
#define MASK_MSC_CFGP22_INT_SEL0 0x02
#define MASK_MSC_CFGP22_INT_SEL1 0x04
#define MASK_MSC_CFGP22_INT_ENB  0x08
#define MASK_MSC_CFGP22_INT_TYPE 0x10

#define MASK_MSC_CFGP23_INT_LEV  0x01
#define MASK_MSC_CFGP23_INT_SEL0 0x02
#define MASK_MSC_CFGP23_INT_SEL1 0x04
#define MASK_MSC_CFGP23_INT_ENB  0x08
#define MASK_MSC_CFGP23_INT_TYPE 0x10

