yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostlux383a.h
#define SMD2_CTR_DTHR_DITH0      SMD2_CTR_DTHR_bit.DITH0
#define SMD2_CTR_DTHR_DITH1      SMD2_CTR_DTHR_bit.DITH1
#define SMD2_CTR_DTHR_DITH2      SMD2_CTR_DTHR_bit.DITH2
#define SMD2_CTR_DTHR_DITH3      SMD2_CTR_DTHR_bit.DITH3
#define SMD2_CTR_DTHR_DITH4      SMD2_CTR_DTHR_bit.DITH4
#define SMD2_CTR_DTHR_DITH5      SMD2_CTR_DTHR_bit.DITH5
#define SMD2_CTR_DTHR_DITH6      SMD2_CTR_DTHR_bit.DITH6
#define SMD2_CTR_DTHR_DITH7      SMD2_CTR_DTHR_bit.DITH7

#define SMD2_TMR_T0L_TIM_T0L0    SMD2_TMR_T0L_bit.TIM_T0L0
#define SMD2_TMR_T0L_TIM_T0L1    SMD2_TMR_T0L_bit.TIM_T0L1
#define SMD2_TMR_T0L_TIM_T0L2    SMD2_TMR_T0L_bit.TIM_T0L2
#define SMD2_TMR_T0L_TIM_T0L3    SMD2_TMR_T0L_bit.TIM_T0L3
#define SMD2_TMR_T0L_TIM_T0L4    SMD2_TMR_T0L_bit.TIM_T0L4
#define SMD2_TMR_T0L_TIM_T0L5    SMD2_TMR_T0L_bit.TIM_T0L5
#define SMD2_TMR_T0L_TIM_T0L6    SMD2_TMR_T0L_bit.TIM_T0L6
#define SMD2_TMR_T0L_TIM_T0L7    SMD2_TMR_T0L_bit.TIM_T0L7

#define SMD2_TMR_T0H_TIM_T0H0    SMD2_TMR_T0H_bit.TIM_T0H0
#define SMD2_TMR_T0H_TIM_T0H1    SMD2_TMR_T0H_bit.TIM_T0H1
#define SMD2_TMR_T0H_TIM_T0H2    SMD2_TMR_T0H_bit.TIM_T0H2
#define SMD2_TMR_T0H_TIM_T0H3    SMD2_TMR_T0H_bit.TIM_T0H3
#define SMD2_TMR_T0H_TIM_T0H4    SMD2_TMR_T0H_bit.TIM_T0H4
#define SMD2_TMR_T0H_TIM_T0H5    SMD2_TMR_T0H_bit.TIM_T0H5
#define SMD2_TMR_T0H_TIM_T0H6    SMD2_TMR_T0H_bit.TIM_T0H6
#define SMD2_TMR_T0H_TIM_T0H7    SMD2_TMR_T0H_bit.TIM_T0H7

#define SMD2_TMR_T1L_TIM_T1L0    SMD2_TMR_T1L_bit.TIM_T1L0
#define SMD2_TMR_T1L_TIM_T1L1    SMD2_TMR_T1L_bit.TIM_T1L1
#define SMD2_TMR_T1L_TIM_T1L2    SMD2_TMR_T1L_bit.TIM_T1L2
#define SMD2_TMR_T1L_TIM_T1L3    SMD2_TMR_T1L_bit.TIM_T1L3
#define SMD2_TMR_T1L_TIM_T1L4    SMD2_TMR_T1L_bit.TIM_T1L4
#define SMD2_TMR_T1L_TIM_T1L5    SMD2_TMR_T1L_bit.TIM_T1L5
#define SMD2_TMR_T1L_TIM_T1L6    SMD2_TMR_T1L_bit.TIM_T1L6
#define SMD2_TMR_T1L_TIM_T1L7    SMD2_TMR_T1L_bit.TIM_T1L7

#define SMD2_TMR_T1H_TIM_T1H0    SMD2_TMR_T1H_bit.TIM_T1H0
#define SMD2_TMR_T1H_TIM_T1H1    SMD2_TMR_T1H_bit.TIM_T1H1
#define SMD2_TMR_T1H_TIM_T1H2    SMD2_TMR_T1H_bit.TIM_T1H2
#define SMD2_TMR_T1H_TIM_T1H3    SMD2_TMR_T1H_bit.TIM_T1H3
#define SMD2_TMR_T1H_TIM_T1H4    SMD2_TMR_T1H_bit.TIM_T1H4
#define SMD2_TMR_T1H_TIM_T1H5    SMD2_TMR_T1H_bit.TIM_T1H5
#define SMD2_TMR_T1H_TIM_T1H6    SMD2_TMR_T1H_bit.TIM_T1H6
#define SMD2_TMR_T1H_TIM_T1H7    SMD2_TMR_T1H_bit.TIM_T1H7

#define SMD2_TMR_T2L_TIM_T2L0    SMD2_TMR_T2L_bit.TIM_T2L0
#define SMD2_TMR_T2L_TIM_T2L1    SMD2_TMR_T2L_bit.TIM_T2L1
#define SMD2_TMR_T2L_TIM_T2L2    SMD2_TMR_T2L_bit.TIM_T2L2
#define SMD2_TMR_T2L_TIM_T2L3    SMD2_TMR_T2L_bit.TIM_T2L3
#define SMD2_TMR_T2L_TIM_T2L4    SMD2_TMR_T2L_bit.TIM_T2L4
#define SMD2_TMR_T2L_TIM_T2L5    SMD2_TMR_T2L_bit.TIM_T2L5
#define SMD2_TMR_T2L_TIM_T2L6    SMD2_TMR_T2L_bit.TIM_T2L6
#define SMD2_TMR_T2L_TIM_T2L7    SMD2_TMR_T2L_bit.TIM_T2L7

#define SMD2_TMR_T2H_TIM_T2H0    SMD2_TMR_T2H_bit.TIM_T2H0
#define SMD2_TMR_T2H_TIM_T2H1    SMD2_TMR_T2H_bit.TIM_T2H1
#define SMD2_TMR_T2H_TIM_T2H2    SMD2_TMR_T2H_bit.TIM_T2H2
#define SMD2_TMR_T2H_TIM_T2H3    SMD2_TMR_T2H_bit.TIM_T2H3
#define SMD2_TMR_T2H_TIM_T2H4    SMD2_TMR_T2H_bit.TIM_T2H4
#define SMD2_TMR_T2H_TIM_T2H5    SMD2_TMR_T2H_bit.TIM_T2H5
#define SMD2_TMR_T2H_TIM_T2H6    SMD2_TMR_T2H_bit.TIM_T2H6
#define SMD2_TMR_T2H_TIM_T2H7    SMD2_TMR_T2H_bit.TIM_T2H7

#define SMD2_TMR_T3L_TIM_T3L0    SMD2_TMR_T3L_bit.TIM_T3L0
#define SMD2_TMR_T3L_TIM_T3L1    SMD2_TMR_T3L_bit.TIM_T3L1
#define SMD2_TMR_T3L_TIM_T3L2    SMD2_TMR_T3L_bit.TIM_T3L2
#define SMD2_TMR_T3L_TIM_T3L3    SMD2_TMR_T3L_bit.TIM_T3L3
#define SMD2_TMR_T3L_TIM_T3L4    SMD2_TMR_T3L_bit.TIM_T3L4
#define SMD2_TMR_T3L_TIM_T3L5    SMD2_TMR_T3L_bit.TIM_T3L5
#define SMD2_TMR_T3L_TIM_T3L6    SMD2_TMR_T3L_bit.TIM_T3L6
#define SMD2_TMR_T3L_TIM_T3L7    SMD2_TMR_T3L_bit.TIM_T3L7

#define SMD2_TMR_T3H_TIM_T3H0    SMD2_TMR_T3H_bit.TIM_T3H0
#define SMD2_TMR_T3H_TIM_T3H1    SMD2_TMR_T3H_bit.TIM_T3H1
#define SMD2_TMR_T3H_TIM_T3H2    SMD2_TMR_T3H_bit.TIM_T3H2
#define SMD2_TMR_T3H_TIM_T3H3    SMD2_TMR_T3H_bit.TIM_T3H3
#define SMD2_TMR_T3H_TIM_T3H4    SMD2_TMR_T3H_bit.TIM_T3H4
#define SMD2_TMR_T3H_TIM_T3H5    SMD2_TMR_T3H_bit.TIM_T3H5
#define SMD2_TMR_T3H_TIM_T3H6    SMD2_TMR_T3H_bit.TIM_T3H6
#define SMD2_TMR_T3H_TIM_T3H7    SMD2_TMR_T3H_bit.TIM_T3H7

#define SMD2_PRM_ID0_NX_STAT0    SMD2_PRM_ID0_bit.NX_STAT0
#define SMD2_PRM_ID0_NX_STAT1    SMD2_PRM_ID0_bit.NX_STAT1
#define SMD2_PRM_ID0_EDGE0       SMD2_PRM_ID0_bit.EDGE0
#define SMD2_PRM_ID0_EDGE1       SMD2_PRM_ID0_bit.EDGE1
#define SMD2_PRM_ID0_CNT_RSTE    SMD2_PRM_ID0_bit.CNT_RSTE
#define SMD2_PRM_ID0_PULS_EDG    SMD2_PRM_ID0_bit.PULS_EDG
#define SMD2_PRM_ID0_HOLD_JMP    SMD2_PRM_ID0_bit.HOLD_JMP
#define SMD2_PRM_ID0_AND_OR      SMD2_PRM_ID0_bit.AND_OR

#define SMD2_PRM_ID1_CEDGE0      SMD2_PRM_ID1_bit.CEDGE0
#define SMD2_PRM_ID1_CEDGE1      SMD2_PRM_ID1_bit.CEDGE1
#define SMD2_PRM_ID1_CNT_RSTC    SMD2_PRM_ID1_bit.CNT_RSTC
#define SMD2_PRM_ID1_PULS_CMP    SMD2_PRM_ID1_bit.PULS_CMP
#define SMD2_PRM_ID1_HOLD_EXIT   SMD2_PRM_ID1_bit.HOLD_EXIT

#define SMD2_PRM_ID2_LATCH_RS    SMD2_PRM_ID2_bit.LATCH_RS

#define SMD2_PRM_S00_NX_STAT0    SMD2_PRM_S00_bit.NX_STAT0
#define SMD2_PRM_S00_NX_STAT1    SMD2_PRM_S00_bit.NX_STAT1
#define SMD2_PRM_S00_EDGE0       SMD2_PRM_S00_bit.EDGE0
#define SMD2_PRM_S00_EDGE1       SMD2_PRM_S00_bit.EDGE1
#define SMD2_PRM_S00_CNT_RSTE    SMD2_PRM_S00_bit.CNT_RSTE
#define SMD2_PRM_S00_PULS_EDG    SMD2_PRM_S00_bit.PULS_EDG
#define SMD2_PRM_S00_HOLD_JMP    SMD2_PRM_S00_bit.HOLD_JMP
#define SMD2_PRM_S00_AND_OR      SMD2_PRM_S00_bit.AND_OR

#define SMD2_PRM_S01_CEDGE0      SMD2_PRM_S01_bit.CEDGE0
#define SMD2_PRM_S01_CEDGE1      SMD2_PRM_S01_bit.CEDGE1
#define SMD2_PRM_S01_CNT_RSTC    SMD2_PRM_S01_bit.CNT_RSTC
#define SMD2_PRM_S01_PULS_CMP    SMD2_PRM_S01_bit.PULS_CMP
#define SMD2_PRM_S01_HOLD_EXIT   SMD2_PRM_S01_bit.HOLD_EXIT

#define SMD2_PRM_S02_LATCH_RS    SMD2_PRM_S02_bit.LATCH_RS

#define SMD2_PRM_S10_NX_STAT0    SMD2_PRM_S10_bit.NX_STAT0
#define SMD2_PRM_S10_NX_STAT1    SMD2_PRM_S10_bit.NX_STAT1
#define SMD2_PRM_S10_EDGE0       SMD2_PRM_S10_bit.EDGE0
#define SMD2_PRM_S10_EDGE1       SMD2_PRM_S10_bit.EDGE1
#define SMD2_PRM_S10_CNT_RSTE    SMD2_PRM_S10_bit.CNT_RSTE
#define SMD2_PRM_S10_PULS_EDG    SMD2_PRM_S10_bit.PULS_EDG
#define SMD2_PRM_S10_HOLD_JMP    SMD2_PRM_S10_bit.HOLD_JMP
#define SMD2_PRM_S10_AND_OR      SMD2_PRM_S10_bit.AND_OR

#define SMD2_PRM_S11_CEDGE0      SMD2_PRM_S11_bit.CEDGE0
#define SMD2_PRM_S11_CEDGE1      SMD2_PRM_S11_bit.CEDGE1
#define SMD2_PRM_S11_CNT_RSTC    SMD2_PRM_S11_bit.CNT_RSTC
#define SMD2_PRM_S11_PULS_CMP    SMD2_PRM_S11_bit.PULS_CMP
#define SMD2_PRM_S11_HOLD_EXIT   SMD2_PRM_S11_bit.HOLD_EXIT

#define SMD2_PRM_S12_LATCH_RS    SMD2_PRM_S12_bit.LATCH_RS

#define SMD2_PRM_S20_NX_STAT0    SMD2_PRM_S20_bit.NX_STAT0
#define SMD2_PRM_S20_NX_STAT1    SMD2_PRM_S20_bit.NX_STAT1
#define SMD2_PRM_S20_EDGE0       SMD2_PRM_S20_bit.EDGE0
#define SMD2_PRM_S20_EDGE1       SMD2_PRM_S20_bit.EDGE1
#define SMD2_PRM_S20_CNT_RSTE    SMD2_PRM_S20_bit.CNT_RSTE
#define SMD2_PRM_S20_PULS_EDG    SMD2_PRM_S20_bit.PULS_EDG
#define SMD2_PRM_S20_HOLD_JMP    SMD2_PRM_S20_bit.HOLD_JMP
#define SMD2_PRM_S20_AND_OR      SMD2_PRM_S20_bit.AND_OR

#define SMD2_PRM_S21_CEDGE0      SMD2_PRM_S21_bit.CEDGE0
#define SMD2_PRM_S21_CEDGE1      SMD2_PRM_S21_bit.CEDGE1
#define SMD2_PRM_S21_CNT_RSTC    SMD2_PRM_S21_bit.CNT_RSTC
#define SMD2_PRM_S21_PULS_CMP    SMD2_PRM_S21_bit.PULS_CMP
#define SMD2_PRM_S21_HOLD_EXIT   SMD2_PRM_S21_bit.HOLD_EXIT

